       IDENTIFICATION DIVISION.
       PROGRAM-ID. DISPLAY-EMPLOYEES.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT EMPLOYEE-FILE ASSIGN TO "EMPLOYEES.DAT"
              ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD EMPLOYEE-FILE.
       01 EMPLOYEE-RECORD.
          02 EMPLOYEE-ID       PIC X(9).
          02 EMPLOYEE-LASTNAME PIC X(10).
          02 EMPLOYEE-FIRSTNAME PIC X(10).
          02 EMPLOYEE-BIRTHDATE PIC X(8).
          02 EMPLOYEE-GENDER    PIC X(1).
          02 EMPLOYEE-EMAIL     PIC X(20).

       WORKING-STORAGE SECTION.
       01 EOF-SWITCH PIC X VALUE 'N'.
       01 TABLE-SIZE PIC 9(4) VALUE 0.
       01 EMPLOYEE-TABLE.
          02 EMPLOYEE-ENTRY OCCURS 100 TIMES.
             03 EMPLOYEE-ID       PIC X(9).
             03 EMPLOYEE-LASTNAME PIC X(10).
             03 EMPLOYEE-FIRSTNAME PIC X(10).
             03 EMPLOYEE-BIRTHDATE PIC X(8).
             03 EMPLOYEE-GENDER    PIC X(1).
             03 EMPLOYEE-EMAIL     PIC X(20).

       PROCEDURE DIVISION.
       MAIN-LOGIC.
          OPEN INPUT EMPLOYEE-FILE
          PERFORM READ-EMPLOYEE-RECORD
          PERFORM UNTIL EOF-SWITCH = 'Y'
             ADD 1 TO TABLE-SIZE
             MOVE EMPLOYEE-ID TO EMPLOYEE-ID( TABLE-SIZE )
             MOVE EMPLOYEE-LASTNAME TO EMPLOYEE-LASTNAME( TABLE-SIZE )
             MOVE EMPLOYEE-FIRSTNAME TO EMPLOYEE-FIRSTNAME( TABLE-SIZE )
             MOVE EMPLOYEE-BIRTHDATE TO EMPLOYEE-BIRTHDATE( TABLE-SIZE )
             MOVE EMPLOYEE-GENDER TO EMPLOYEE-GENDER( TABLE-SIZE )
             MOVE EMPLOYEE-EMAIL TO EMPLOYEE-EMAIL( TABLE-SIZE )
             PERFORM READ-EMPLOYEE-RECORD
          END-PERFORM
          CLOSE EMPLOYEE-FILE
          PERFORM DISPLAY-EMPLOYEES
          STOP RUN.

       DISPLAY-EMPLOYEES.
          PERFORM VARYING TABLE-INDEX FROM 1 BY 1 UNTIL 
          TABLE-INDEX > TABLE-SIZE
             DISPLAY "Numéro d'identification : "
              EMPLOYEE-ID( TABLE-INDEX )
             DISPLAY "Nom : " EMPLOYEE-LASTNAME( TABLE-INDEX )
             DISPLAY "Prénom : " EMPLOYEE-FIRSTNAME( TABLE-INDEX )
             DISPLAY "Date de naissance : "
              EMPLOYEE-BIRTHDATE( TABLE-INDEX )
             DISPLAY "Genre : " EMPLOYEE-GENDER( TABLE-INDEX )
             DISPLAY "Adresse e-mail : " EMPLOYEE-EMAIL( TABLE-INDEX )
             DISPLAY "--------------------------------"
          END-PERFORM.

       READ-EMPLOYEE-RECORD.
          READ EMPLOYEE-FILE
             AT END MOVE 'Y' TO EOF-SWITCH.
